Revit 2026 API

# BorderTile Enumeration

---

Options for controlling tiles that overlap the face boundary. See DividedSurface.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BorderTile
```
```vb
Public Enumeration BorderTile
```
```cpp
public enum class BorderTile
```
```fsharp
type BorderTile
```

| Member name | Value | Description |
| --- | --- | --- |
| Empty | 0 |  |
| Overhanging | 2 |  |
| Partial | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace